{
  "lJHXNYdV3JRagRcGDqugsCgRFMk2": {
    "Blockchain - Half chapter 3.pdf": {
      "summary": "The document appears to be a lecture notes on distributed consensus algorithms, particularly in the context of permissioned blockchains. Here's a summary of the key points:\n\n**Introduction**\n\n* Distributed consensus is a mechanism for reaching an agreement among nodes in a network\n* Permissioned blockchain refers to a blockchain where access is restricted to authorized nodes\n\n**Why Distributed Consensus?**\n\n* In distributed computing, multiple decision-makers need to agree on a single value or state\n* State machine replication (SMR) is a technique used to ensure that all nodes have the same view of the system's state\n\n**Types of Faults in Distributed Systems**\n\n* Crash faults: a node crashes and cannot send messages\n* Network or partition faults: the network partitions, preventing communication between nodes\n* Byzantine faults: a malicious node behaves differently depending on its perspective (e.g., sending conflicting values)\n\n**Consensus for 3 Processes**\n\n* Each process can have one of three states:\n\t+ Undecided: proposed value has been exchanged but not agreed upon\n\t+ Communication: exchanging values to reach agreement\n\t+ Decided: agreement reached, decision variable set\n\n**Requirements of Consensus Algorithm**\n\n* Termination: each correct process sets its decision variable\n* Agreement: all correct processes agree on the same decision value\n* Integrity: if all correct processes propose the same value, any correct process in the decided state chooses that value\n\n**Different Algorithms**\n\n* Initial algorithms for distributed consensus:\n\t+ Paxos (supports crash and network faults)\n\t+ RAFT (also supports crash and network faults)\n* Later algorithms to support Byzantine faults:\n\t+ Not explicitly mentioned in the lecture notes, but may include algorithms like PBFT (Parallel Byzantine Fault Tolerance)\n\n**Key Takeaways**\n\n* Distributed consensus is essential for permissioned blockchains to ensure consistency across nodes\n* State machine replication is a key technique used in distributed consensus algorithms\n* Crash, network, and Byzantine faults can occur in distributed systems, requiring robust consensus algorithms to handle them.",
      "savedAt": "2025-10-14T08:59:21.984Z"
    },
    "Rabbit_and_Tortoise_Summary.docx": {
      "summary": "Here is a concise summary of the document in bullet points:\n\n**Summary**\n\n* A fast but overconfident rabbit challenges a slow-moving tortoise to a race.\n* The rabbit takes a nap midway, thinking he has already won.\n* Meanwhile, the tortoise continues steadily without stopping and crosses the finish line first.\n* The moral of the story is: \"Slow and steady wins the race.\"\n\n**Key Points**\n\n* Importance of perseverance and humility\n* Dangers of overconfidence and complacency\n* Value of steady effort and determination over speed and talent",
      "savedAt": "2025-10-14T20:24:07.141Z"
    },
    "Blockchain- 2 chapter.pdf": {
      "summary": "The provided text is a collection of notes on various topics related to Bitcoin and blockchain technology. Here's a breakdown of the main points covered:\n\n**Bitcoin Basics**\n\n* Bitcoin mining refers to ensuring that transactions are valid and added to the Bitcoin blockchain correctly using a global network of computers running the Bitcoin code.\n* The process of mining involves verifying new transactions against the Bitcoin network, which results in the production of new bitcoin.\n\n**Block Propagation**\n\n* Block propagation time or block propagation delay determines the limits of Bitcoin’s scaling.\n* It's an average time that is needed for the new block to reach the majority of nodes in the network.\n* Researchers have found that for blocks larger than 20kB, the block propagation delay is nearly proportional to the block size.\n\n**Bitcoin Network**\n\n* The Bitcoin P2P network is formed of miner nodes where the nodes randomly connect with each other.\n* Transactions and blocks are transmitted over this network by these nodes until each has received the message.\n* The diffusion increases exponentially as the hops increase, and after 12–15 hops, the entire network receives the message.\n\n**Block Propagation on Network Plane**\n\n* Blockchain throughput is measured by the number of transactions per second that it can support.\n* The current Block capacity for Bitcoin is 1MB for a Block interval of 10 minutes and given the average transaction size of nearly 540 bytes, the Bitcoin network currently processes ~1950 transactions per Block, which translates to ~3 transactions per second (TPS).\n\n**Bitcoin Relay Network**\n\n* The Bitcoin Relay Network is a system of peering between nodes in the network by creating a system of high-speed relay nodes for miners and merchants/exchanges.\n* This system acts as a fall back in the case that the public Bitcoin network encounters issues and decreases block propagation times between miners.\n\nOverall, these notes provide an overview of various aspects of Bitcoin and blockchain technology, including mining, block propagation, and the Bitcoin Relay Network.",
      "savedAt": "2025-10-14T19:41:40.944Z"
    },
    "Unit_2_Data_Science_ppt.pdf": {
      "summary": "It appears you provided a large amount of text about statistical tests, including parametric and non-parametric tests. I'll provide a summary and answer any specific questions you may have.\n\n**Summary:**\n\nThe text covers various types of statistical tests, including:\n\n1. **Parametric Tests**: These tests assume that the data follows a specific distribution (e.g., normal distribution) and require interval or ratio scales.\n2. **Non-Parametric Tests**: These tests do not assume any specific distribution and can be used with ordinal or nominal data.\n\n**Types of Data:**\n\nThe text also covers different types of data, including:\n\n1. **Nominal Data**: Non-numerical values (e.g., blood grouping).\n2. **Ordinal Data**: Values that have a natural order or ranking.\n3. **Discrete Data**: Whole numbers or counts (e.g., number of suitcases lost).\n4. **Continuous Data**: Infinite possible values, often associated with physical measurements.\n\n**Parametric Test Procedures:**\n\nThe text outlines the procedures for parametric tests, which involve:\n\n1. Using population parameters (e.g., mean and standard deviation).\n2. Requiring interval or ratio scales.\n3. Assumptions about the underlying distribution (e.g., normal distribution).\n\n**Non-Parametric Test Procedures:**\n\nNon-parametric tests do not require specific conditions about the shape of populations or population parameters.\n\n**Wilcoxon Rank Sum Test (Mann-Whitney Utest):**\n\nThis is a non-parametric test used to assess whether two samples come from the same distribution. It requires independent observations and ordinal or continuous measurements.\n\n**Specific Questions:**\n\nIf you have any specific questions about statistical tests or data types, please let me know, and I'll do my best to answer them.",
      "savedAt": "2025-10-14T20:48:55.382Z"
    }
  }
}